tests/validation/simmons_and_azzopardi/dMOM/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     multiphaseEulerFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         6;

deltaT          2.5e-04;//3e-04;//5e-05;//0.00005;

writeControl    timeStep;//timeStep;//adjustableRunTime;

writeInterval   100;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression compressed;

timeFormat      general;

timePrecision   10;

runTimeModifiable on;

adjustTimeStep  no;

maxCo           0.25;

maxDeltaT       1e-02;

libs ("libPBE.so");

// ************************************************************************* //
