tests/validation/simmons_and_azzopardi/dMOM/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 1;

diameter   0.063;
length     4.5;
oil_inlet_fraction 0.938;

corner     #calc "$diameter / sqrt(2.0)";

sqrX       #calc "0.18 * $corner";
// Correction for the area based phase fraction
oilX       #calc "0.50 * $corner * sqrt($oil_inlet_fraction)";
waterX     #calc "0.50 * $corner";

msqrX      #calc "-$sqrX";
moilX      #calc "-$oilX";
mwaterX    #calc "-$waterX";

sqrXarc    #calc "sqrt(2.0) * 0.8 * $sqrX";
msqrXarc   #calc "-$sqrXarc";
oilXarc    #calc "sqrt(2.0) * $oilX";
moilXarc   #calc "-$oilXarc";
waterXarc  #calc "sqrt(2.0) * $waterX";
mwaterXarc #calc "-$waterXarc";

vertices
(
 ($msqrX $msqrX 0 ) //0
 ($sqrX $msqrX 0 ) //1
 ($sqrX $sqrX 0 ) //2
 ($msqrX $sqrX 0 ) //3
 ($msqrX $msqrX $length ) //4
 ($sqrX $msqrX $length ) //5
 ($sqrX $sqrX $length ) //6
 ($msqrX $sqrX $length ) //7
 ($oilX $oilX 0 ) //8
 ($moilX $oilX 0 ) //9
 ($oilX $oilX $length ) //10
 ($moilX $oilX $length ) //11
 ($moilX $moilX 0 ) //12
 ($moilX $moilX $length ) //13
 ($oilX $moilX 0 ) //14
 ($oilX $moilX $length ) //15
 ($waterX $waterX 0 ) //16
 ($mwaterX $waterX 0 ) //17
 ($waterX $waterX $length ) //18
 ($mwaterX $waterX $length ) //19
 ($mwaterX $mwaterX 0 ) //20
 ($mwaterX $mwaterX $length ) //21
 ($waterX $mwaterX 0 ) //22
 ($waterX $mwaterX $length ) //23
);


edges
(
 arc 0 1 (0 $msqrXarc 0)
 arc 1 2 ($sqrXarc 0 0)
 arc 2 3 (0 $sqrXarc 0)
 arc 3 0 ($msqrXarc 0 0)
 arc 4 5 (0 $msqrXarc $length)
 arc 5 6 ($sqrXarc 0 $length)
 arc 6 7 (0 $sqrXarc $length)
 arc 7 4 ($msqrXarc 0 $length)
 arc 8 9 (0 $oilXarc 0)
 arc 10 11 (0 $oilXarc $length)
 arc 9 12 ($moilXarc 0 0)
 arc 11 13 ($moilXarc 0 $length)
 arc 12 14 (0 $moilXarc 0)
 arc 13 15 (0 $moilXarc $length)
 arc 14 8 ($oilXarc 0 0)
 arc 15 10 ($oilXarc 0 $length)
 arc 16 17 (0 $waterXarc 0)
 arc 18 19 (0 $waterXarc $length)
 arc 17 20 ($mwaterXarc 0 0)
 arc 19 21 ($mwaterXarc 0 $length)
 arc 20 22 (0 $mwaterXarc 0)
 arc 21 23 (0 $mwaterXarc $length)
 arc 22 16 ($waterXarc 0 0)
 arc 23 18 ($waterXarc 0 $length)
);

blocks
(
 hex (0 1 2 3 4 5 6 7 ) (9 9 250 ) simpleGrading (1 1 3 )
 hex (2 8 9 3 6 10 11 7 ) (12 9 250 ) simpleGrading (1 1 3 )
 hex (3 9 12 0 7 11 13 4 ) (12 9 250 ) simpleGrading (1 1 3 )
 hex (0 12 14 1 4 13 15 5 ) (12 9 250 ) simpleGrading (1 1 3 )
 hex (1 14 8 2 5 15 10 6 ) (12 9 250 ) simpleGrading (1 1 3 )
 hex (8 16 17 9 10 18 19 11 ) (5 9 250 ) simpleGrading (1 1 3 )
 hex (9 17 20 12 11 19 21 13 ) (5 9 250 ) simpleGrading (1 1 3 )
 hex (12 20 22 14 13 21 23 15 ) (5 9 250 ) simpleGrading (1 1 3 )
 hex (14 22 16 8 15 23 18 10 ) (5 9 250 ) simpleGrading (1 1 3 )
);

boundary
(
    walls
    {
    type wall;
    faces
    (
     (16 17 19 18)
     (17 20 21 19)
     (20 22 23 21)
     (22 16 18 23)
    );
    }

    outlet
    {
    type patch;
    faces
    (
     (4 5 6 7)
     (6 10 11 7)
     (7 11 13 4)
     (4 13 15 5)
     (5 15 10 6)
     (10 18 19 11)
     (11 19 21 13)
     (13 21 23 15)
     (15 23 18 10)
    );
    }

    oilInlet
    {
     type patch;
     faces
     (
      (0 1 2 3)
      (2 8 9 3)
      (3 9 12 0)
      (0 12 14 1)
      (1 14 8 2)
     );
    }

    waterInlet
    {
     type patch;
     faces
      (
       (8 16 17 9)
       (9 17 20 12)
       (12 20 22 14)
       (14 22 16 8)
      );
    }
);

