tests/validation/simmons_and_azzopardi/dMOM/constant/phaseProperties
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.3;
 format ascii;
 class dictionary;
 location "constant";
 object phaseProperties;
}

phases
  (
    acps
    kerosene
  );

acps
{
  diameterModel PBEDiameter;
  PBEDiameterCoeffs
  {
    method diameterMethodOfMoments;
    dMOMCoeffs
    {
      usingMULES 1;
    }
    coalescenceKernel CoulaloglouTavlaridesC;
    breakupKernel CoulaloglouTavlarides;
    daughterParticleDistribution uniformBinaryBreakup;
    uniformBinaryBreakupCoeffs
    {
    }
    CoulaloglouTavlaridesCCoeffs
    {
      c1 4.5e6;
      c2 1.891e12;
      sigma 0.01;
      gamma 0.0;
    }
    CoulaloglouTavlaridesCoeffs
    {
      c1 0.1;
      c2 0.06354; 	//c1 and c2 after Hsia and Talvarides (1983)
      sigma 0.01;
      gamma 0.0;
    }
  }
  constantCoeffs
  {
    d 0.00042;
  }
  residualAlpha 1e-06;
} 	//aqueous potassium carbonate solution

kerosene
{
  diameterModel constant;
  constantCoeffs
  {
    d 0.001;
  }
  residualAlpha 1e-06;
}

blending
{
  default
  {
    type none;
    continuousPhase kerosene;
  }
}

sigma
  (

    (
      kerosene
      and
      acps
    )
    0.0
  );

aspectRatio
  (

    (
      acps
      in
      kerosene
    )

    {
      type constant;
      E0 1.0;

    }
  );

drag
  (

    (
      acps
      in
      kerosene
    )

    {
      type SchillerNaumann;
      residualRe 0.001;
      swarmCorrection
      {
        type none;
      }

    }
  );

virtualMass
  (

    (
      acps
      in
      kerosene
    )

    {
      type constantCoefficient;
      Cvm 0.5;

    }
  );

heatTransfer
  (

    (
      acps
      in
      kerosene
    )

    {
      type RanzMarshall;
      residualAlpha 0.0001;

    }
  );

lift
  (
  );

wallLubrication
  (
  );

turbulentDispersion
  (
  ); 	// Minimum allowable pressure

pMin 10000; 	// ************************************************************************* //

