tests/validation/simmons_and_azzopardi/dMOM/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [ 1 -1 -2 0 0 0 0 ];

internalField       uniform 1e5;

boundaryField
{
    walls
    {
        type        fixedFluxPressure;
        value       $internalField;
    }
    outlet
    {
        type        prghPressure;;
        p           $internalField;
        value       $internalField;
    }
    oilInlet
    {
        type        fixedFluxPressure;
        value       $internalField;
    }
    waterInlet
    {
        type        fixedFluxPressure;
        value       $internalField;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
