tests/validation/simmons_and_azzopardi/dMOM/0/alpha.acps
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.acps;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    outlet
    {
        type             inletOutlet;
        inletValue       uniform 0;
    }
    walls
    {
        type            zeroGradient;
    }
    oilInlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    waterInlet
    {
        type            fixedValue;
        value           uniform 1;
    }
}


// ************************************************************************* //
