tests/validation/simmons_and_azzopardi/dMOM/0/k.kerosene
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k.kerosene;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.01516; 

boundaryField
{
    outlet
    {
        type            inletOutlet;
        phi             phi.kerosene;
        inletValue      $internalField;
    }
    walls
    {
        type            kqRWallFunction;
	value		uniform 1e-10;
    }
    oilInlet
    {
        type            fixedValue;
        value           $internalField;
    }
    waterInlet
    {
        type            fixedValue;
        value           $internalField;
    }
}


// ************************************************************************* //
